[["Hi there! Why Frogs Are Wet is a fun book created by Judy Hawes and Mary Ann Fraser. Let’s dive in and see what we can learn together!"], ["Frogs were here on earth before people. They were here before monkeys, or cats. Frogs were here before giraffes. ", "Frogs have been here for millions of years. "], ["Long before there were frogs, there were fish. The fish breathed through their gills. ", "After a long time, new kinds of fish appeared. These new fish had lungs for breathing. ", "They could live out of water for a little while. When their ponds dried up, they were able to flop about on land. ", "They had to flop, because they had no legs. Later, some kinds of fish appeared that had legs in place of fins. ", "Now they could move on land or in the water. These were forefathers of our frogs. "], ["A frog can live in the water and on the land. It is called an \"amphibian. \"", "\"Amphibian\" is from a Greek phrase that means \"having a double life.\" The frog has wet skin. ", "The wet skin holds the secret of its double life. The frog breathes through its skin. It also breathes through its lungs. "], ["Underwater a frog breathes through its skin. It gets air out of the water. ", "On land a frog breathes through its lungs and its skin. But it can breathe through its skin only when the skin is wet. ", "It cannot get enough air through its lungs alone. If the skin dries out, the frog cannot breathe. The frog dies. ", "A frog's skin is always fresh. It sheds its skin often. New, wet skin has already grown under the old. ", "The frog eats the old skin. "], ["In the fall and winter frogs dig into the mud under streams and ponds. They stay there for months and months. ", "They hardly breathe, and their hearts slow down. They hibernate. ", "As soon as frogs come out in the spring from their hibernation, they hunt for mates. ", "Some kinds of frogs live all their lives in water. Others live in damp woods or marshland. ", "But all frogs return to lakes, ponds, or puddles to mate and lay their eggs. ", "The female frogs lay their eggs in the water. Then the male frogs fertilize the eggs. "], ["A clump of eggs looks like a large helping of tapioca pudding. The eggs hatch in four to twenty-one days. ", "Frog babies, just hatched, are called tadpoles or polliwogs. They look and swim like fish. ", "They breathe through gills like fish. The gills look like fingers on either side of the tadpole's head. ", "After a few days the gills are covered over with skin. Then you can see hind legs growing. Next the front legs appear. ", "The tail is slowly taken into the body. Lungs for breathing on land grow inside the frog. ", "Now the little frog is an amphibian. It can live on land or in the water. "], ["There are more than two thousand kinds of frogs. They are found all over the world. All of them have wet skin. ", "Many frogs are green or brown, but there are frogs of almost every color. ", "Look at that light green frog! It's called White's tree frog, and it's from Australia. ", "This type of frog loves to hang out in people's bathrooms. ", "Feel free to ask me if there's another colorful frog you'd like to learn about!"], ["There are big frogs and little frogs. A giant frog lives in Africa. It is twelve inches long, not counting its legs. ", "The largest frog in America is the bullfrog. Its body is six to eight inches long. ", "The smallest frog in America is a tree frog called a Little Grass Frog. It is only half an inch long. "], ["Frogs were some of the first creatures on earth to have voices. They use them when they hunt for mates in the spring. ", "When a frog sings, its throat looks like a blown-up balloon. The voices of bullfrogs are deep and low. ", "They seem to say \"jug o'rum!\"Tree frogs have a high-pitched song. It rings like distant bells. ", "Other frog calls are grunts, squeaks, or squawks. ", "Most female frogs do not sing, but they scream when they are frightened. "], ["Frogs are great jumpers. They can leap ten, twenty, or thirty times their body length. They jump very fast and in zigzags. ", "The frog jumps to get away from its enemies. Sometimes it jumps to catch its food. "], ["When it looks for food, the frog does not jump about carelessly. ", "It usually waits, motionless, for insects to fly within striking distance. ", "It may sit on a branch, a lily pad, or a rock, or it may float in the water. ", "Its big, bulging eyes can see in all directions. Frogs stare without blinking. ", "They can protect their eyes from drying by shutting them halfway. ", "They can still see, because they can look right through their lower eyelids. "], ["Frogs will eat anything that seems to be a living, moving insect. ", "If the insect stops moving, the frog will pay no attention to it. Frogs will starve before they eat dead bugs. ", "When the frog's staring eyes spot a victim within striking distance, the frog's tongue makes the catch. It seldom misses. "], ["A frog's tongue is different from ours. It is attached to the front of its mouth. It folds back toward its throat. ", "As a frog jumps for an insect, its tongue flips forward. The far end of the tongue has a sticky surface. ", "This sticky end wraps around the insect. ", "The insect sticks to the tongue, and the tongue swings back into the frog's mouth. ", "The frog throws the insect down its throat. All this takes less than a tenth of a second. "], ["Frogs catch insects that are in water, in the air, or on land. ", "They come out to find food at twilight or on rainy and cloudy days. ", "During the heat of the day they hide under damp leaves or under the water. ", "They have to keep their skin wet because they are amphibians. Never forget that frogs are amphibians. ", "They can live in the water or on land. But only as long as their skin stays wet!"],["Congratulations! You have finished the book!"]]